Catalogs/ПодПрограммыТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПодПрограммыТермообработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнеКамеры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Процессы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроцесса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаПроцесса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаПроцессаЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаПроцессаМинут</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаПроцессаДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемператураВКамере</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемператураВБатоне</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПШ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Влажность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодПрограммыТермообработки/Forms/ФормаЭлементаУФ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры // ПриСозданииНаСервере // + claude

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоПрограмме(Команда)
	// заполнить ТЧ процессы из программы термообработки // + claude
	Если ПустаяСтрока(Объект.Программа) Тогда
		Предупреждение("Не выбрана программа термообработки!");
		Возврат;
	КонецЕсли; // Если ПустаяСтрока
	ЗаполнитьПоПрограммеНаСервере();
КонецПроцедуры // ЗаполнитьПоПрограмме

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоПрограммеНаСервере()
	// копируем виды процессов из ТЧ Процессы программы в ТЧ подпрограммы // + claude
	Объект.Процессы.Очистить();

	СпрПрограмма = Объект.Программа.ПолучитьОбъект();
	Если СпрПрограмма = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если СпрПрограмма

	Для Каждого СтрПроцесс Из СпрПрограмма.Процессы Цикл
		НоваяСтрока = Объект.Процессы.Добавить();
		НоваяСтрока.ВидПроцесса = СтрПроцесс.ВидПроцесса;
	КонецЦикла; // Для Каждого СтрПроцесс
КонецПроцедуры // ЗаполнитьПоПрограммеНаСервере // + claude

// вычислить дни/часы/минуты из общего количества минут // + claude
&НаКлиенте
Процедура ПроцессыДлинаПроцессаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Процессы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТекущиеДанные

	ВсегоМинут = ТекущиеДанные.ДлинаПроцесса;
	Дней  = 0;
	Часов = 0;
	Минут = 0;

	Если ВсегоМинут > 0 Тогда
		ТекЧасов = ВсегоМинут / 60;
		Часов = Цел(ТекЧасов);
		Минут = ВсегоМинут - Часов * 60;

		Если Часов > 23 Тогда
			ТекДней = Часов / 24;
			Дней  = Цел(ТекДней);
			Часов = Часов - Дней * 24;
		КонецЕсли; // Если Часов > 23
	КонецЕсли; // Если ВсегоМинут > 0

	ТекущиеДанные.ДлинаПроцессаДней  = Дней;
	ТекущиеДанные.ДлинаПроцессаЧасов = Часов;
	ТекущиеДанные.ДлинаПроцессаМинут = Минут;
КонецПроцедуры // ПроцессыДлинаПроцессаПриИзменении // + claude

#КонецОбласти
